tests/requests/example/search_and_format.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="http://oss.dbc.dk/ns/opensearch">
  <SOAP-ENV:Body>
    <ns1:searchRequest>
      <ns1:query>"No country for old men"</ns1:query>
      <ns1:agency>190101</ns1:agency>
      <ns1:profile>default</ns1:profile>
      <ns1:stepValue>1</ns1:stepValue>
      <ns1:objectFormat>bibliotekdkWorkDisplay</ns1:objectFormat>
      <ns1:objectFormat>dkabm</ns1:objectFormat>
      <ns1:sort>date_descending</ns1:sort>
    </ns1:searchRequest>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
