xml/request/several_facets.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="http://oss.dbc.dk/ns/opensearch"><SOAP-ENV:Body>
<ns1:searchRequest>
 <ns1:query>dc.creator=(danmarks%20statistik)</ns1:query>
 <ns1:agency></ns1:agency>
 <ns1:facets>
  <ns1:numberOfTerms>20</ns1:numberOfTerms>
  <ns1:facetName>facet.creator</ns1:facetName>
  <ns1:facetName>facet.type</ns1:facetName>
  <ns1:facetName>facet.language</ns1:facetName>
  <ns1:facetName>facet.subject</ns1:facetName>
  <ns1:facetName>facet.date</ns1:facetName>
  <ns1:facetName>facet.dk5</ns1:facetName>
 </ns1:facets>
 <ns1:source></ns1:source>
 <ns1:start>0</ns1:start>
 <ns1:stepValue>10</ns1:stepValue>
</ns1:searchRequest>
</SOAP-ENV:Body></SOAP-ENV:Envelope>
